; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	infrared2 - mode
	image5 - mode
	image3 - mode
	thermograph4 - mode
	infrared0 - mode
	spectrograph1 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star9 - direction
	GroundStation8 - direction
	GroundStation0 - direction
	GroundStation11 - direction
	GroundStation10 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation6 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation0)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation10)
	(calibration_target instrument0 GroundStation8)
	(supports instrument1 image5)
	(supports instrument1 spectrograph1)
	(supports instrument1 image3)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 infrared2)
	(supports instrument2 image5)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation8)
	(supports instrument3 image5)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph4)
	(calibration_target instrument3 GroundStation4)
	(calibration_target instrument3 GroundStation10)
	(supports instrument4 infrared0)
	(supports instrument4 spectrograph1)
	(supports instrument4 image5)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation11)
	(supports instrument5 image5)
	(supports instrument5 spectrograph1)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star5)
	(supports instrument6 thermograph4)
	(supports instrument6 infrared2)
	(calibration_target instrument6 GroundStation6)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(on_board instrument6 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
)
(:goal (and
	(have_image Star12 infrared0)
	(have_image Star13 infrared2)
	(have_image Star13 infrared0)
	(have_image Planet14 image3)
	(have_image Planet15 spectrograph1)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 0 of 5
4. (calibrate satellite0 instrument0 groundstation8)
   added: (calibrated instrument0)
   goals met: 0 of 5
5. (turn_to satellite1 groundstation3 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 5
6. (turn_to satellite0 planet14 groundstation8)
   deleted: (pointing satellite0 groundstation8)
   added: (pointing satellite0 planet14)
   goals met: 0 of 5
7. (take_image satellite0 planet14 instrument0 image3)
   added: (have_image planet14 image3)
   goals met: 1 of 5
8. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 1 of 5
9. (calibrate satellite1 instrument4 groundstation3)
   added: (calibrated instrument4)
   goals met: 1 of 5
10. (turn_to satellite1 groundstation4 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 groundstation4)
   goals met: 1 of 5
11. (turn_to satellite1 planet15 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 planet15)
   goals met: 1 of 5
12. (take_image satellite1 planet15 instrument4 spectrograph1)
   added: (have_image planet15 spectrograph1)
   goals met: 2 of 5
13. (turn_to satellite1 groundstation4 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 groundstation4)
   goals met: 2 of 5
14. (turn_to satellite1 star12 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star12)
   goals met: 2 of 5
15. (take_image satellite1 star12 instrument4 infrared0)
   added: (have_image star12 infrared0)
   goals met: 3 of 5
16. (turn_to satellite1 groundstation4 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 groundstation4)
   goals met: 3 of 5
17. (turn_to satellite1 star13 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star13)
   goals met: 3 of 5
18. (take_image satellite1 star13 instrument4 infrared0)
   added: (have_image star13 infrared0)
   goals met: 4 of 5
19. (switch_off instrument4 satellite1)
   deleted: (power_on instrument4)
   added: (power_avail satellite1)
   goals met: 4 of 5
20. (switch_on instrument6 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument6)
   goals met: 4 of 5
21. (turn_to satellite1 groundstation6 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 groundstation6)
   goals met: 4 of 5
22. (calibrate satellite1 instrument6 groundstation6)
   added: (calibrated instrument6)
   goals met: 4 of 5
23. (turn_to satellite1 star13 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 star13)
   goals met: 4 of 5
24. (take_image satellite1 star13 instrument6 infrared2)
   added: (have_image star13 infrared2)
   goals met: 5 of 5
